
 var txt1 =  document.getElementById("txt1");
 var btn1 = document.getElementById('btn1');
 var out1 = document.getElementById('output1'); 
 //console.log(txt1)

 var NumToBangla = {
     '০': 'শুন্য',
     '১': 'এক',
     '২': 'দুই',
     '৩': 'তিন',
     '৪': 'চার',
     '৫': 'পাঁচ',
     '৬': 'ছয়',
     '৭': 'সাত',
     '৮': 'আট',
     '৯': 'নয়',
     '১০': 'দশ',
     '১১': 'এগারো',
     '১২': 'বারো',
     '১৩': 'তেরো',
     '১৪': 'চৌদ্দ',
     '১৫': 'পনেরো',
     '১৬': 'ষোল',
     '১৭': 'সতেরো',
     '১৮': 'আঠারো',
     '১৯': 'ঊনিশ',
     '২০': 'বিশ',
     '২১': 'একুশ',
     '২২': 'বাইশ',
     '২৩': 'তেইশ',
     '২৪': 'চব্বিশ',
     '২৫': 'পঁচিশ',
     '২৬': 'ছাব্বিশ',
     '২৭': 'সাতাশ',
     '২৮': 'আঠাশ',
     '২৯': 'ঊনত্রিশ',
     '৩০': 'ত্রিশ',
     '৩১': 'একত্রিশ',
     '৩২': 'বত্রিশ',
     '৩৩': 'তেত্রিশ', 
     '৩৪': 'চৌত্রিশ',
     '৩৫': 'পঁয়ত্রিশ',
     '৩৬': 'ছত্রিশ',
     '৩৭': 'সাইত্রিশ',
     '৩৮': 'আটত্রিশ',
     '৩৯': 'ঊনচল্লিশ',
     '৪০': 'চল্লিশ',
     '৪১': 'একচল্লিশ',
     '৪২': 'বিয়াল্লিশ',
     '৪৩': 'তেতাল্লিশ',
     '৪৪': 'চুয়াল্লিশ',
     '৪৫': 'পঁয়তাল্লিশ',
     '৪৬': 'ছেচল্লিশ',
     '৪৭': 'সাতচল্লিশ',
     '৪৮': 'আটচল্লিশ',
     '৪৯': 'ঊনপঞ্চাশ',
     '৫০': 'পঞ্চাশ',
     '৫১': 'একান্ন',
     '৫২': 'বায়ান্ন',
     '৫৩': 'তিপ্পান্ন',
     '৫৪': 'চুয়ান্ন',
     '৫৫': 'পঞ্চান্ন',
     '৫৬': 'ছাপ্পান্ন',
     '৫৭': 'সাতান্ন',
     '৫৮': 'আটান্ন',
     '৫৯': 'ঊনষাট',
     '৬০': 'ষাট',
     '৬১': 'একষট্টি',
     '৬২': 'বাষট্টি',
     '৬৩': 'তেষট্টি',
     '৬৪': 'চৌষট্টি',
     '৬৫': 'পঁয়ষট্টি',
     '৬৬': 'ছেষট্টি',
     '৬৭': 'সাতষট্টি',
     '৬৮': 'আটষট্টি',
     '৬৯': 'ঊনসত্তর',
     '৭০': 'সত্তর',
     '৭১': 'একাত্তর',
     '৭২': 'বাহাত্তর',
     '৭৩': 'তিয়াত্তর',
     '৭৪': 'চুয়াত্তর',
     '৭৫': 'পঁচাত্তর',
     '৭৬': 'ছিয়াত্তর',
     '৭৭': 'সাতাত্তর',
     '৭৮': 'আটাত্তর',
     '৭৯': 'ঊনআশি',
     '৮০': 'আশি',
     '৮১': 'একাশি',
     '৮২': 'বিরাশি',
     '৮৩': 'তিরাশি',
     '৮৪': 'চুরাশি',
     '৮৫': 'পঁচাশি',
     '৮৬': 'ছিয়াশি',
     '৮৭': 'সাতাশি',
     '৮৮': 'আটাশি',
     '৮৯': 'ঊননব্বই',
     '৯০': 'নব্বই',
     '৯১': 'একানব্বই',
     '৯২': 'বিরানব্বই',
     '৯৩': 'তিরানব্বই',
     '৯৪': 'চুরানব্বই',
     '৯৫': 'পঁচানব্বই',
     '৯৬': 'ছিয়ানব্বই',
     '৯৭': 'সাতানব্বই',
     '৯৮': 'আটানব্বই',
     '৯৯': 'নিরানব্বই',
     '১০০': 'একশো',
     '২০০': 'দুইশো',
     '৩০০': 'তিনশো',
     '৪০০': 'চারশো',
     '৫০০': 'পাঁচশো',
     '৬০০': 'ছয়শো',
     '৭০০': 'সাতশো',
     '৮০০': 'আটশো',
     '৯০০': 'নয়শো',
     '১০০০': 'এক হাজার'  
 }
 var BanglatoEng = {
     '0': 0,
     '১': 2,
     '২': 3,
     '৩': 4,
     '৪': 4,
     '৫': 5,
     '৬': 6,
     '৭': 7,
     '৮': 8,
     '৯': 9,
     '১০': 10,
     '১১': 11,
     '১২': 12,
     '১৩': 13,
     '১৪': 14,
     '১৫': 15,
     '১৬': 16,
     '১৭': 17,
     '১৮': 18,
     '১৯': 19,
     '২০': 20,
     '২১': 21,
     '২২': 22,
     '২৩': 23,
     '২৪': 24,
     '২৫': 25,
     '২৬': 26,
     '২৭': 27,
     '২৮': 28,
     '২৯': 29,
     '৩০': 30,
     '৩১': 31,
     '৩২': 32,
     '৩৩': 33, 
     '৩৪': 34,
     '৩৫': 35,
     '৩৬': 36,
     '৩৭': 37,
     '৩৮': 38,
     '৩৯': 39,
     '৪০': 40,
     '৪১': 41,
     '৪২': 42,
     '৪৩': 43,
     '৪৪': 44,
     '৪৫': 45,
     '৪৬': 46,
     '৪৭': 47,
     '৪৮': 48,
     '৪৯': 49,
     '৫০': 50,
     '৫১': 51,
     '৫২': 52,
     '৫৩': 53,
     '৫৪': 54,
     '৫৫': 55,
     '৫৬': 56,
     '৫৭': 57,
     '৫৮': 58,
     '৫৯': 59,
     '৬০': 60,
     '৬১': 61,
     '৬২': 62,
     '৬৩': 63,
     '৬৪': 64,
     '৬৫': 65,
     '৬৬': 66,
     '৬৭': 67,
     '৬৮': 68,
     '৬৯': 69,
     '৭০': 70,
     '৭১': 71,
     '৭২': 72,
     '৭৩': 73,
     '৭৪': 74,
     '৭৫': 75,
     '৭৬': 76,
     '৭৭': 77,
     '৭৮': 78,
     '৭৯': 79,
     '৮০': 80,
     '৮১': 81,
     '৮২': 82,
     '৮৩': 83,
     '৮৪': 84,
     '৮৫': 85,
     '৮৬': 86,
     '৮৭': 'সাতাশি',
     '৮৮': 'আটাশি',
     '৮৯': 'ঊননব্বই',
     '৯০': 'নব্বই',
     '৯১': 'একানব্বই',
     '৯২': 'বিরানব্বই',
     '৯৩': 'তিরানব্বই',
     '৯৪': 'চুরানব্বই',
     '৯৫': 'পঁচানব্বই',
     '৯৬': 'ছিয়ানব্বই',
     '৯৭': 'সাতানব্বই',
     '৯৮': 'আটানব্বই',
     '৯৯': 'নিরানব্বই',
     '১০০': 'একশো',
     '২০০': 'দুইশো',
     '৩০০': 'তিনশো',
     '৪০০': 'চারশো',
     '৫০০': 'পাঁচশো',
     '৬০০': 'ছয়শো',
     '৭০০': 'সাতশো',
     '৮০০': 'আটশো',
     '৯০০': 'নয়শো',
     '১০০০': 'এক হাজার'  
 }
var NEGATIVE = 'ঋণাত্মক ';
var DECIMAL = ' দশমিক';
var ONE_HUNDRED = 100;
var ONE_THOUSAND = 1000;
var ONE_LAC = 100000;
var ONE_CORE = 10000000
var ONE_BILLION = 1000000000;
var ONE_TRILLION = 1000000000000;       

var number2WordMap = {
 0 : "শূন্য",
 1 : "এক", 
 2 : "দুই", 
 3 : "তিন", 
 4 : "চার", 
 5 : "পাঁচ", 
 6 : "ছয়", 
 7 : "সাত", 
 8 : "আট", 
 9 : "নয়", 
 10 : "দশ", 
 11 : "এগারো", 
 12 : "বারো", 
 13 : "তেরো", 
 14 : "চৌদ্দ", 
 15 : "পনের", 
 16 : "ষোল", 
 17 : "সতের", 
 18 : "আঠার", 
 19 : "উনিশ", 
 20 : "বিশ", 
 21 : "একুশ", 
 22 : "বাইশ", 
 23 : "তেইশ", 
 24 : "চব্বিশ", 
 25 : "পঁচিশ", 
 26 : "ছাব্বিশ", 
 27 : "সাতাশ", 
 28 : "আটাশ", 
 29 : "ঊনত্রিশ", 
 30 : "ত্রিশ", 
 31 : "একত্রিশ", 
 32 : "বত্রিশ", 
 33 : "তেত্রিশ", 
 34 : "চৌত্রিশ", 
 35 : "পঁয়ত্রিশ", 
 36 : "ছত্রিশ", 
 37 : "সাইত্রিশ", 
 38 : "আটত্রিশ", 
 39 : "ঊনচল্লিশ", 
 40 : "চল্লিশ", 
 41 : "একচল্লিশ", 
 42 : "বিয়াল্লিশ", 
 43 : "তেতাল্লিশ", 
 44 : "চুয়াল্লিশ", 
 45 : "পঁয়তাল্লিশ", 
 46 : "ছিচল্লিশ", 
 47 : "সাতচল্লিশ",
 48 : "আটচল্লিশ", 
 49 : "ঊনপঞ্চাশ", 
 50 : "পঞ্চাশ", 
 51 : "একান্ন", 
 52 : "বাহান্ন", 
 53 : "তেপ্পান্ন", 
 54 : "চুয়ান্ন", 
 55 : "পঞ্চান্ন", 
 56 : "ছাপ্পান্ন", 
 57 : "সাতান্ন", 
 58 : "আটান্ন", 
 59 : "ঊনষাট", 
 60 : "ষাট", 
 61 : "একষট্টি", 
 62 : "বাষট্টি", 
 63 : "তেষট্টি", 
 64 : "চৌষট্টি", 
 65 : "পঁয়ষট্টি", 
 66 : "ছেষট্টি", 
 67 : "সাতষট্টি", 
 68 : "আটষট্টি", 
 69 : "উনসত্তুর", 
 70 : "সত্তর", 
 71 : "একাত্তর", 
 72 : "বাহাত্তর", 
 73 : "তেহাত্তুর", 
 74 : "চুয়াত্তর", 
 75 : "পঁচাত্তর",
 76 : "ছিয়াত্তর", 
 77 : "সাতাত্তর", 
 78 : "আটাত্তর", 
 79 : "ঊনআশি", 
 80 : "আশি", 
 81 : "একাশি", 
 82 : "বিরাশি", 
 83 : "তিরাশি", 
 84 : "চুরাশি", 
 85 : "পঁচাশি", 
 86 : "ছিয়াশি", 
 87 : "সাতাশি", 
 88 : "আটাশি", 
 89 : "উননব্বই", 
 90 : "নব্বই", 
 91 : "একানব্বই", 
 92 : "বিরানব্বই", 
 93 : "তিরানব্বই", 
 94 : "চুরানব্বই", 
 95 : "পঁচানব্বই", 
 96 : "ছিয়ানব্বই", 
 97 : "সাতানব্বই", 
 98 : "আটানব্বই", 
 99 : "নিরানব্বই", 
 100 : "শত", 
 1000 : "হাজার", 
 100000 : "লক্ষ", 
 10000000 : "কোটি"
};
 
 /*function doit(){ 
   x= txt1.value;
   
   res = (x.match(/[০-৯]+/g));
   
   for(var i=0; i<res.length; i++){
     num = res[i]; 
     x = x.replace(num,NumToBangla[num]);
     //console.log(int('৪৫'));   
   }   
   

   }*/
   function rep(){
     a = txt1.value;

     y = (a.match(/[০-৯]+/g));

     for (var i=0; i<y.length; i++){
       z = y[i];
       a = a.replace(z, BanglatoEng[z]);

     }
   //console.log(num[i]);   
   out1.innerHTML = a;    
   } 

   function generateWords(number) {

   var remainder, word, words = arguments[1];

   if(number === 0){
     return  !words ? number2WordMap[0] : words.join(' ').replace(/,$/, '');
   }

   if (!words) {
     words = [];
 }

   if (number < 0) {
     words.push(NEGATIVE);
     number = Math.abs(number);
 }

   if (number < ONE_HUNDRED) {
     remainder = 0;
     word = number2WordMap[number];
 } 
   else if (number < ONE_THOUSAND) {
   remainder = number % ONE_HUNDRED;
   word = number2WordMap[Math.floor(number / ONE_HUNDRED)] + number2WordMap[ONE_HUNDRED];
 }
   else if (number < ONE_LAC) {
   remainder = number % ONE_THOUSAND;
   word = number2WordMap[Math.floor(number / ONE_THOUSAND)] + ' ' + number2WordMap[ONE_THOUSAND];
 }
 else if (number < ONE_CORE) {
   remainder = number % ONE_LAC;
   word = number2WordMap[Math.floor(number/ONE_LAC)] + ' ' + number2WordMap[ONE_LAC];
 }

 words.push(word);
 return generateWords(remainder, words);
 }
   

btn1.addEventListener('click',rep);
