function word_conversion(z){

    if (z.length == 1){
        return NumToBangla[z];
    }
    else if (z.length == 2){
        return NumToBangla[z];
    }
    else if(z.length == 3){
        return (NumToBangla[z[0]] + "শো " + NumToBangla[z.slice(1,)] );
    }
    else if(z.length == 4){
        return (NumToBangla[z[0]] + " হাজার " + NumToBangla[z[1]] + " শো " + NumToBangla[z.slice(2,)]);
    }
    else if(z.length == 5){
        return (NumToBangla[z.slice(0,2)] + " হাজার " + NumToBangla[z[2]] + "শো " + NumToBangla[z.slice(3,)]);
    }
    else if(z.length == 6){
        return (NumToBangla[z[0]] + " লক্ষ " + (NumToBangla[z.slice(1,3)])  + " হাজার " + NumToBangla[z[3]] + "শো " + NumToBangla[z.slice(4,)]); 
    }
    else if(z.length == 8){
        return (NumToBangla[z[0]] + " কোটি " + NumToBangla[z.slice(1,3)] + " লক্ষ " + NumToBangla[z.slice(3,5)] + " হাজার " + NumToBangla[z[5]] + " শো " + NumToBangla[z.slice(6,)]);
    }

}

var NumToBangla = { 
    '০': 'শুন্য',
    '১': 'এক',
    '২': 'দুই',
    '৩': 'তিন',
    '৪': 'চার',
    '৫': 'পাঁচ',
    '৬': 'ছয়',
    '৭': 'সাত',
    '৮': 'আট',
    '৯': 'নয়',
    '০১': 'এক',
    '০২': 'দুই',
    '০৩': 'তিন',
    '০৪': 'চার',
    '০৫': 'পাঁচ',
    '০৬': 'ছয়',
    '০৭': 'সাত',
    '০৮': 'আট',
    '০৯': 'নয়',
    '১০': 'দশ',
    '১১': 'এগারো',
    '১২': 'বারো',
    '১৩': 'তেরো',
    '১৪': 'চৌদ্দ',
    '১৫': 'পনেরো',
    '১৬': 'ষোল',
    '১৭': 'সতেরো',
    '১৮': 'আঠারো',
    '১৯': 'ঊনিশ',
    '২০': 'বিশ',
    '২১': 'একুশ',
    '২২': 'বাইশ',
    '২৩': 'তেইশ',
    '২৪': 'চব্বিশ',
    '২৫': 'পঁচিশ',
    '২৬': 'ছাব্বিশ',
    '২৭': 'সাতাশ',
    '২৮': 'আঠাশ',
    '২৯': 'ঊনত্রিশ',
    '৩০': 'ত্রিশ',
    '৩১': 'একত্রিশ',
    '৩২': 'বত্রিশ',
    '৩৩': 'তেত্রিশ', 
    '৩৪': 'চৌত্রিশ',
    '৩৫': 'পঁয়ত্রিশ',
    '৩৬': 'ছত্রিশ',
    '৩৭': 'সাইত্রিশ',
    '৩৮': 'আটত্রিশ',
    '৩৯': 'ঊনচল্লিশ',
    '৪০': 'চল্লিশ',
    '৪১': 'একচল্লিশ',
    '৪২': 'বিয়াল্লিশ',
    '৪৩': 'তেতাল্লিশ',
    '৪৪': 'চুয়াল্লিশ',
    '৪৫': 'পঁয়তাল্লিশ',
    '৪৬': 'ছেচল্লিশ',
    '৪৭': 'সাতচল্লিশ',
    '৪৮': 'আটচল্লিশ',
    '৪৯': 'ঊনপঞ্চাশ',
    '৫০': 'পঞ্চাশ',
    '৫১': 'একান্ন',
    '৫২': 'বায়ান্ন',
    '৫৩': 'তিপ্পান্ন',
    '৫৪': 'চুয়ান্ন',
    '৫৫': 'পঞ্চান্ন',
    '৫৬': 'ছাপ্পান্ন',
    '৫৭': 'সাতান্ন',
    '৫৮': 'আটান্ন',
    '৫৯': 'ঊনষাট',
    '৬০': 'ষাট',
    '৬১': 'একষট্টি',
    '৬২': 'বাষট্টি',
    '৬৩': 'তেষট্টি',
    '৬৪': 'চৌষট্টি',
    '৬৫': 'পঁয়ষট্টি',
    '৬৬': 'ছেষট্টি',
    '৬৭': 'সাতষট্টি',
    '৬৮': 'আটষট্টি',
    '৬৯': 'ঊনসত্তর',
    '৭০': 'সত্তর',
    '৭১': 'একাত্তর',
    '৭২': 'বাহাত্তর',
    '৭৩': 'তিয়াত্তর',
    '৭৪': 'চুয়াত্তর',
    '৭৫': 'পঁচাত্তর',
    '৭৬': 'ছিয়াত্তর',
    '৭৭': 'সাতাত্তর',
    '৭৮': 'আটাত্তর',
    '৭৯': 'ঊনআশি',
    '৮০': 'আশি',
    '৮১': 'একাশি',
    '৮২': 'বিরাশি',
    '৮৩': 'তিরাশি',
    '৮৪': 'চুরাশি',
    '৮৫': 'পঁচাশি',
    '৮৬': 'ছিয়াশি',
    '৮৭': 'সাতাশি',
    '৮৮': 'আটাশি',
    '৮৯': 'ঊননব্বই',
    '৯০': 'নব্বই',
    '৯১': 'একানব্বই',
    '৯২': 'বিরানব্বই',
    '৯৩': 'তিরানব্বই',
    '৯৪': 'চুরানব্বই',
    '৯৫': 'পঁচানব্বই',
    '৯৬': 'ছিয়ানব্বই',
    '৯৭': 'সাতানব্বই',
    '৯৮': 'আটানব্বই',
    '৯৯': 'নিরানব্বই',
    '১০০': 'একশো',
    '২০০': 'দুইশো',
    '৩০০': 'তিনশো',
    '৪০০': 'চারশো',
    '৫০০': 'পাঁচশো',
    '৬০০': 'ছয়শো',
    '৭০০': 'সাতশো',
    '৮০০': 'আটশো',
    '৯০০': 'নয়শো',
    '১০০০': 'এক হাজার'  
}

class MyClass{

    Unit2Words(){
        var UnitsToNum = {
            '২' : 'এক জোড়া',
            '৪' : 'এক হালি',
            '১২' : 'এক ডজন',
            '২০' : 'কুড়ি',
            //'২০' : 'গণ্ডা', 
            '১/৪' : 'চৌথা/সিকি/পোয়া',
            '১/৩' : 'তেহাই',
            '১/২' : 'অর্ধ / আধা',
            '১.২৫' : 'সোয়া/সওয়া',
            '১.৫' : 'দেড়',
            '২.৫' : 'আড়াই' 
        }
    
    var a = '২ রান করা লক্ষ্ণৌ কলকাতাকে ৪ রানে গুটিয়ে দিয়েছে। ১.৫ রানের এই জয়ে পয়েন্ট টেবিলের শীর্ষে চলে গেছে লক্ষ্ণৌ। কাগজে-কলমে ২০ হলেও এবার প্লে-অফটাও প্রায় নিশ্চিত হয়ে গেল দলটির। ওদিকে ১.২৫ ম্যাচে ১.৫ হারে আট পয়েন্ট নিয়ে ১/৪ থাকল কলকাতা নাইট রাইডার্স।';

    var y = a.match(/(২০|৪|২|১২|১\/২|১\/৩|১\/৪|১.৫|২.৫|১.২৫)+/g);         
    //console.log(y);
    for(var i=0; i<y.length; i++){
        var z = y[i];
        var a = a.replace(z, UnitsToNum[z]);
        //console.log(a);
    }
    return a;
}
    Num2Word(){

        
        var a = '৩৪ শিশুর প্রতি নিষ্ঠুরতার দণ্ড';
    
        var y = (a.match(/[০-৯]+/g));
        //console.log(y);
        
    
        for (var i=0; i<y.length; i++){
            var z = y[i];
            var a = a.replace(z, NumToBangla[z]);
        }
        
        return a;      
    } 

    Ord2Word(){

        var OrdinalToWords = {
            '১ম' : 'প্রথম / পহেলা',
            '২য়' : 'দ্বিতীয়',
            '৩য়' : 'তৃতীয়', 
            '৪র্থ' : 'চতুর্থ',
            '৫ম' : 'পঞ্চম',
            '৬ষ্ঠ': 'ষষ্ঠ',
            '৭ম': 'সপ্তম',
            '৮ম': 'অষ্টম',
            '৯ম':'নবম',
            '১০ম':'দশম',
            '১১তম':'একাদশ',
            '১২তম':'দ্বাদশ',
            '১৩তম':'ত্রয়োদশ',
            '১৪তম':'চতুর্দশ',
            '১৫তম':'পঞ্চদশ',
            '১৬তম':'ষোড়শ',
            '১৭তম':'সপ্তদশ',
            '১৮তম':'অষ্টাদশ',
            '১৯তম':'ঊনবিংশ',
            '২০তম':'বিংশ',
            '২১তম':'একবিংশ',
            '২২তম':'দ্বাবিংশ',
            '২৩তম':'ত্রয়োবিংশ',
            '২৪তম':'চতুর্বিংশ',
            '২৫তম':'পঞ্চবিংশ',
            '২৬তম':'ষট্‌বিংশ',
            '২৭তম':'সপ্তবিংশ',
            '২৮তম':'অষ্টাবিংশ',
            '২৯তম':'ঊনত্রিংশ',
            '৩০তম':'ত্রিংশ',
            '৩১তম':'একত্রিংশ',
            '৩২তম':'দ্বাত্রিংশ',
            '৩৩তম':'ত্রয়োত্রিংশ',
            '৩৪তম':'চতুর্ত্রিংশ',
            '৩৫তম':'পঞ্চত্রিংশ',
            '৩৬তম':'ষট্‌ত্রিংশ',
            '৩৭তম':'সপ্তত্রিংশ',
            '৩৮তম':'অষ্টাত্রিংশ',
            '৩৯তম':'ঊনচত্বারিংশ',
            '৪০তম':'চত্বারিংশ',
            '৪১তম':'একচত্বারিংশ',
            '৪২তম':'দ্বিচত্বারিংশ',
            '৪৩তম':'ত্রয়শ্চত্বারিংশ',
            '৪৪তম':'চতুঃচত্বারিংশ',
            '৪৫তম':'পঞ্চচত্বারিংশ',
            '৪৬তম':'ষট্‌চত্বারিংশ',
            '৪৭তম':'সপ্তচত্বারিংশ',
            '৪৮তম':'অষ্টচত্বারিংশ',
            '৪৯তম':'ঊনপঞ্চাশৎ',
            '৫০তম':'পঞ্চাশৎ',
            '৫১তম':'একপঞ্চাশৎ',
            '৫২তম':'দ্বিপঞ্চাশৎ',
            '৫৩তম':'ত্রিপঞ্চাশৎ',
            '৫৪তম':'চতুঃপঞ্চাশৎ',
            '৫৫তম':'পঞ্চপঞ্চাশৎ',
            '৫৬তম':'ষট্‌পঞ্চাশৎ',
            '৫৭তম':'সপ্তপঞ্চাশৎ',
            '৫৮তম':'অষ্টপঞ্চাশৎ',
            '৫৯তম':'ঊনষষ্টি',
            '৬০তম':'ষষ্টি',
            '৬১তম':'একষষ্টি',
            '৬২তম':'দ্বিষ্টি',
            '৬৩তম':'ত্রিষষ্টি',
            '৬৪তম':'চতুঃষষ্টি',
            '৬৫তম':'পঞ্চষষ্টি',
            '৬৬তম':'ষট্‌ষষ্টি',
            '৬৭তম':'সপ্তষষ্টি',
            '৬৮তম':'অষ্টষষ্টি',
            '৬৯তম':'ঊনসপ্ততি',
            '৭০তম':'সপ্ততি',
            '৭১তম':'একসপ্ততি',
            '৭২তম':'দ্বিসপ্ততি',
            '৭৩তম':'ত্রিসপ্ততি',
            '৭৪তম':'চতুঃসপ্ততি',
            '৭৫তম':'পঞ্চসপ্ততি',
            '৭৬তম':'ষট্‌সপ্ততি',
            '৭৭তম':'সপ্তসপ্ততি',
            '৭৮তম':'অষ্টসপ্ততি',
            '৭৯তম':'ঊনাশীতি',
            '৮০তম':'অশীতি',
            '৮১তম':'একাশীতি',
            '৮২তম':'দ্ব্যশীতি',
            '৮৩তম':'ত্র্যশীতি',
            '৮৪তম':'চতুরশীতি',
            '৮৫তম':'পঞ্চাশীতি',
            '৮৬তম':'ষড়শীতি',
            '৮৭তম':'সপ্তাশীতি',
            '৮৮তম':'অষ্টাশীতি',
            '৮৯তম':'ঊননবতি',
            '৯০তম':'নবতি',
            '৯১তম':'একনবতি',
            '৯২তম':'দ্বিনবতি',
            '৯৩তম':'ত্রিনবতি',
            '৯৪তম':'চতুর্নবতি',
            '৯৫তম':'পঞ্চনবতি',
            '৯৬তম':'ষন্নবতি',
            '৯৭তম':'সপ্তনবতি',
            '৯৮তম':'অষ্টনবতি',
            '৯৯তম':'নবনবতি',
            '১০০তম': 'একশত'
        }

        var a = '২১তম শতাব্দীর ৮ম আশ্চর্য কি হতে পারে';
    
        var y = (a.match(/([০-৯]+(ম|য়|র্থ|ষ্ঠ|তম))+/g));
        //console.log(y);
    
        for (var i=0; i<y.length; i++){
            var z = y[i];
            var a = a.replace(z, OrdinalToWords[z]);
        }
        return a;
    }

    Date2Words(){

        var DateToWords = {
            '১লা':'পহেলা',
            '২রা':'দোসরা',
            '৩রা':'তেসরা',
            '৪ঠা':'চৌঠা',
            '৫ই':'পাঁচই',
            '৬ই':'ছয়ই',
            '৭ই':'সাতই',
            '৮ই':'আটই',
            '৯ই':'নউই',
            '১০ই':'দশই',
            '১১ই':'এগারই',
            '১২ই':'বারই',
            '১৩ই':'তেরই',
            '১৪ই':'চৌদ্দই',
            '১৫ই':'পনেরই',
            '১৬ই':'ষোলই',
            '১৭ই':'সতেরই',
            '১৮ই':'আঠারই',
            '১৯শে':'উনিশই',
            '২০শে':'বিশে',
            '২১শে':'একুশে',
            '২২শে':'বাইশে',
            '২৩শে':'তেইশে',
            '২৪শে':'চব্বিশে',
            '২৫শে':'পঁচিশে',
            '২৬শে':'ছাব্বিশে',
            '২৭শে':'সাতাশে',
            '২৮শে':'আটাশে',
            '২৯শে':'ঊনত্রিশে',
            '৩০শে':'ত্রিশে',
            '৩১শে':'একত্রিশে'
        }

        var a = '৮ই এপ্রিল সরকার তদন্ত শুরু করে';
        
        var y = a.match(/([০-৯]+(লা|রা|ঠা|ই|শে))+/g);
         //console.log(y); 
    
        for (var i=0; i<y.length; i++){
            var z = y[i];
            var a = a.replace(z, DateToWords[z]);
        }
        return a;
    }
    
    
    
    NumtoWord(){
        var a = '১৪৭৫৭০';
    
        var y = (a.match(/[০-৯]+/g));
        
    
        for (var i=0; i<y.length; i++){
        
            var z = y[i];
            var a = a.replace(z, word_conversion(z));
        }
    return a;       
    
} 


    add(arg1, arg2){
        var result = arg1+ arg2;
        return result;
    }

}

module.exports = MyClass;